In [2]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\Users\viper\Desktop\NOTES\AI ML DS\sl.csv")
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [4]:
print(df.head())

    Age  Gender Education Level          Job Title  Years of Experience  \
0  32.0    Male      Bachelor's  Software Engineer                  5.0
1  28.0  Female        Master's       Data Analyst                  3.0
2  45.0    Male             PhD     Senior Manager                 15.0
3  36.0  Female      Bachelor's    Sales Associate                  7.0
4  52.0    Male        Master's           Director                 20.0

     Salary
0   90000.0
1   65000.0
2  150000.0
3   60000.0
4  200000.0

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB
None

In [6]:
print(df.shape)

(6704, 6)

### Data Cleaning

In [7]:
df.isnull().sum()

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [8]:
df.fillna({"Education Level":"Bachelor's","Job Title":"Software Engineer","Years of Experience":df["Years of Experience"].mean(),"Salary":df["Salary"].mean()},inplace=True)

In [10]:
df.isnull().sum()

Age                    2
Gender                 2
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [9]:
df["Education Level"].value_counts()

Education Level
Bachelor's Degree    2267
Master's Degree      1573
PhD                  1368
Bachelor's            759
High School           448
Master's              288
phD                     1
Name: count, dtype: int64

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le=LabelEncoder()

In [12]:
df["eduction_level_encoder"]=le.fit_transform(df["Education Level"])

df["job_title_encoder"]=le.fit_transform(df["Job Title"])

df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,eduction_level_encoder,job_title_encoder
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0,0,177
1,28.0,Female,Master's,Data Analyst,3.0,65000.0,3,18
2,45.0,Male,PhD,Senior Manager,15.0,150000.0,5,145
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0,0,116
4,52.0,Male,Master's,Director,20.0,200000.0,3,26
...,...,...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0,5,34
6700,32.0,Male,High School,Sales Associate,3.0,50000.0,2,116
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0,1,42
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0,4,97
6703,26.0,Female,High School,Sales Executive,1.0,35000.0,2,118

In [27]:
X = df[["eduction_level_encoder", "job_title_encoder", "Years of Experience"]]
y = df["Salary"]

In [25]:
from sklearn.model_selection import train_test_split

In [40]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [29]:
from sklearn.linear_model import LinearRegression

In [41]:
model = LinearRegression()
model.fit(X_train, y_train)  # Train the model
model.score(X_test, y_test)

0.65520003160604

In [31]:
df[["eduction_level_encoder"]]

      eduction_level_encoder
0                          0
1                          3
2                          5
3                          0
4                          3
...                      ...
6699                       5
6700                       2
6701                       1
6702                       4
6703                       2

[6704 rows x 1 columns]

In [32]:
print(df["Job Title"].nunique())

193

In [33]:
(df["Job Title"].value_counts())

Job Title
Software Engineer                 520
Data Scientist                    453
Software Engineer Manager         376
Data Analyst                      363
Senior Project Engineer           318
                                 ...
Junior Social Media Specialist      1
Senior Software Architect           1
Developer                           1
Social M                            1
Social Media Man                    1
Name: count, Length: 193, dtype: int64

In [34]:
(df["Education Level"].value_counts())

Education Level
Bachelor's Degree    2267
Master's Degree      1573
PhD                  1368
Bachelor's            759
High School           448
Master's              288
phD                     1
Name: count, dtype: int64

In [35]:
( df[df["Job Title"] == "Software Engineer"]["job_title_encoder"])

0       177
172     177
260     177
376     177
380     177
       ...
6191    177
6205    177
6219    177
6233    177
6247    177
Name: job_title_encoder, Length: 520, dtype: int64

In [36]:
(df[df["Education Level"] == "Bachelor's"]["eduction_level_encoder"])

0       0
3       0
5       0
7       0
8       0
       ..
1196    0
1198    0
1199    0
1200    0
2011    0
Name: eduction_level_encoder, Length: 759, dtype: int64

In [42]:
y_pred = model.predict(X_test)
model.predict([[0, 0, 5]])
model.predict([[1,2,3]])

C:\Users\viper\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\LocalCache\local-packages\Python311\site-packages\sklearn\utils\validation.py:2739: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(
C:\Users\viper\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\LocalCache\local-packages\Python311\site-packages\sklearn\utils\validation.py:2739: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([81717.86108431])

In [38]:
model.score(X_test, y_test)  # Test the model

0.65520003160604

In [39]:
import joblib
joblib.dump(model, "salary_prediction.pkl")  # Save model

# Load model later
loaded_model = joblib.load("salary_prediction.pkl")